# Pandas DataFrame drop rows

In [1]:
import pandas as pd

In [10]:
students = [
    ('Archana',22,'Salem','India'),
    ('Mani',23,'Coimbatore','India'),
    ('Kalpana',31,'Los Vegas','US'),
    ('Thiru',37,'New York','US'),
    ('Ashwin',24,'Bangalore','India'),
    ('Roseline',23,'Mumbai','India')
]

In [11]:
students

[('Archana', 22, 'Salem', 'India'),
 ('Mani', 23, 'Coimbatore', 'India'),
 ('Kalpana', 31, 'Los Vegas', 'US'),
 ('Thiru', 37, 'New York', 'US'),
 ('Ashwin', 24, 'Bangalore', 'India'),
 ('Roseline', 23, 'Mumbai', 'India')]

In [12]:
data = pd.DataFrame(students)

In [13]:
data

          0   1           2      3
0   Archana  22       Salem  India
1      Mani  23  Coimbatore  India
2   Kalpana  31   Los Vegas     US
3     Thiru  37    New York     US
4    Ashwin  24   Bangalore  India
5  Roseline  23      Mumbai  India

In [14]:
# To change the columns

In [15]:
data = pd.DataFrame(students, columns=["Name","Age","City","Country"])

In [16]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [17]:
# If we want to drop the records with one relational operator

In [18]:
data['Age'] > 30

0    False
1    False
2     True
3     True
4    False
5    False
Name: Age, dtype: bool

In [19]:
# To remove this particular rows of age greater than 30, we need to know the indexes of these two

In [20]:
data[data['Age'] > 30]

      Name  Age       City Country
2  Kalpana   31  Los Vegas      US
3    Thiru   37   New York      US

In [21]:
data[data['Age'] > 30].index

Int64Index([2, 3], dtype='int64')

In [22]:
to_del = data[data['Age'] > 30].index

In [23]:
data.drop(to_del) # that 2 particular rows alone got deleted

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [24]:
data # see but original original dataframe the 2 rows are not removed

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [25]:
# To delete permanently, we need to assign to the data

In [26]:
data = data.drop(to_del)

In [27]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

# Another approach

In [28]:
students = [
    ('Archana',22,'Salem','India'),
    ('Mani',23,'Coimbatore','India'),
    ('Kalpana',31,'Los Vegas','US'),
    ('Thiru',37,'New York','US'),
    ('Ashwin',24,'Bangalore','India'),
    ('Roseline',23,'Mumbai','India')
]

In [29]:
data = pd.DataFrame(students)

In [30]:
data

          0   1           2      3
0   Archana  22       Salem  India
1      Mani  23  Coimbatore  India
2   Kalpana  31   Los Vegas     US
3     Thiru  37    New York     US
4    Ashwin  24   Bangalore  India
5  Roseline  23      Mumbai  India

In [31]:
data = pd.DataFrame(students, columns=["Name","Age","City","Country"])

In [32]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [33]:
to_del = data[data['Age'] > 30].index

In [34]:
data.drop(to_del, inplace=True)

In [35]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [36]:
# This will remove permanently in original dataframe

# Another Example

In [37]:
students = [
    ('Archana',22,'Salem','India'),
    ('Mani',23,'Coimbatore','India'),
    ('Kalpana',31,'Los Vegas','US'),
    ('Thiru',37,'New York','US'),
    ('Ashwin',24,'Bangalore','India'),
    ('Roseline',23,'Mumbai','India')
]

In [38]:
data = pd.DataFrame(students, columns=["Name","Age","City","Country"])

In [39]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [40]:
# To remove, the person who is residing in "Bangalore"

In [41]:
data['City']

0         Salem
1    Coimbatore
2     Los Vegas
3      New York
4     Bangalore
5        Mumbai
Name: City, dtype: object

In [42]:
data['City'] == 'Bangalore'

0    False
1    False
2    False
3    False
4     True
5    False
Name: City, dtype: bool

In [44]:
data[data['City'] == 'Bangalore'].index

Int64Index([4], dtype='int64')

In [48]:
to_del = data[data['City'] == 'Bangalore'].index

In [49]:
data.drop(to_del) # this will remove temporarily

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
5  Roseline   23      Mumbai   India

In [50]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [51]:
# To remove permanently

In [52]:
students = [
    ('Archana',22,'Salem','India'),
    ('Mani',23,'Coimbatore','India'),
    ('Kalpana',31,'Los Vegas','US'),
    ('Thiru',37,'New York','US'),
    ('Ashwin',24,'Bangalore','India'),
    ('Roseline',23,'Mumbai','India')
]

In [53]:
data = pd.DataFrame(students, columns=["Name","Age","City","Country"])

In [54]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [55]:
data[data['City'] == 'Bangalore'].index

Int64Index([4], dtype='int64')

In [56]:
to_del = data[data['City'] == 'Bangalore'].index

In [57]:
data.drop(to_del, inplace=True)

In [58]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
5  Roseline   23      Mumbai   India

# Another Example

In [59]:
students = [
    ('Archana',22,'Salem','India'),
    ('Mani',23,'Coimbatore','India'),
    ('Kalpana',31,'Los Vegas','US'),
    ('Thiru',37,'New York','US'),
    ('Ashwin',24,'Bangalore','India'),
    ('Roseline',23,'Mumbai','India')
]

In [60]:
data = pd.DataFrame(students, columns=["Name","Age","City","Country"])

In [61]:
data

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
2   Kalpana   31   Los Vegas      US
3     Thiru   37    New York      US
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [62]:
data[(data['Age'] > 15) & (data['Age'] < 30)]

       Name  Age        City Country
0   Archana   22       Salem   India
1      Mani   23  Coimbatore   India
4    Ashwin   24   Bangalore   India
5  Roseline   23      Mumbai   India

In [63]:
# If we want to drop these rows

In [64]:
data[(data['Age'] > 15) & (data['Age'] < 30)].index

Int64Index([0, 1, 4, 5], dtype='int64')

In [65]:
to_del = data[(data['Age'] > 15) & (data['Age'] < 30)].index

In [66]:
data.drop(to_del, inplace=True)

In [67]:
data

      Name  Age       City Country
2  Kalpana   31  Los Vegas      US
3    Thiru   37   New York      US

In [68]:
# Those rows alone got removed from the dataframe